app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @rooms = Room.all

INSERT INTO "rooms" ("title", "location", "descripition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Teste1"], ["location", "Aqui"], ["descripition", "testando a aplicacao"], ["created_at", "2015-08-21 00:20:13.439800"], ["updated_at", "2015-08-21 00:20:13.439800"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_room
      @room = Room.find(params[:id])